#+SETUPFILE: ~/.emacs.d/org-init/level-0.orgsetup
* Elixir
** Installation
*** Runtime
    #+BEGIN_SRC sh :tangle no
      brew install elixir
    #+END_SRC
**** TODO Auto-install run-time on package installation
**** TODO Provide docker-compose set-up in lieu of host install

*** Packages
    #+BEGIN_SRC emacs-lisp
      (require-package 'smartparens)
      (require-package 'alchemist "20180312.604" 'alchemist-mode "alchemist")
      (add-to-list 'package-pinned-packages
                   '(alchemist . "melpa-stable") t)

      (require-package 'elixir-mode "20170918.2231" 'elixir-mode)
      (add-to-list 'package-pinned-packages
                   '(elixir-mode . "melpa-stable") t)

      (eval-after-load 'elixir-mode
        '(progn
           (require-package 'elixir-yasnippets "20150417.539")
           (require-package 'ob-elixir) 
           ))

      (add-to-list 'auto-mode-alist '("\\.exs?$" . elixir-mode))

      (defun toby/elixir-init ()
        (alchemist-mode t)
        (company-mode t)
        (linum-mode t)
        (toby/activate-structured-editing nil))

      (defun remove-dos-eol ()
        "Do not show ^M in files containing mixed line-endings"
        (setq buffer-display-table (make-display-table))
        (aset buffer-display-table ?\^M []))

      (add-hook 'elixir-mode-hook 'toby/elixir-init)
      (add-hook 'alchemist-test-mode-hook 'remove-dos-eol)
    #+END_SRC

    #+RESULTS:
    | alchemist-mode-hook | toby/elixir-init |

** Alchemist Mode Commands

*** IEx interaction:

    | Key       | Command                                |                         |
    | C-c a i i | alchemist-iex-run                      | Start the Elixir REPL   |
    | C-c a i p | alchemist-iex-project-run              | Start IEx from Mix      |
    | C-c a i l | alchemist-iex-send-current-line        |                         |
    | C-C a i c | alchemist-iex-send-current-line-and-go | Send and jump to buffer |
    | C-c a i r | alchemist-iex-send-region              |                         |
    | C-c a i m | alchemist-iex-send-region-and-go       |                         |
    | C-c a i b | alchemist-iex-compile-this-bufferL     |                         |

*** Code evaluation

    | Key       | Command                     |   |
    | C-c a v w | alchemist-eval-print-buffer |   |


** Company Integration

   #+BEGIN_QUOTE
   When Alchemist finds company-mode it enables completion inside in
   IEx process buffer.

   Documention lookup inside an IEx process buffer will also be
   activated.

   When the keybinding C-d is used on one of the selected completion
   candidates, a documentation lookup for the candidate will be made
   and displayed in another window.
   #+END_QUOTE

** Package definition

   #+BEGIN_SRC emacs-lisp
     (provide 'elixir-lang)
   #+END_SRC
